let assert = require('assert')
  ;

let target = require('../src/jpr')
  ;

describe('[Tokyo] 測地系について', () => {
  describe('系番号1', () => {
    it('長崎の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-2862, 29086], 1, 'Tokyo'), [129.46702893433056, 33.26558876847196])
    })
  })

  describe('系番号2', () => {
    it('福岡の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-19435, 61387], 2, 'Tokyo'), [130.78829753130807, 33.55669815386815])
    })
  })

  describe('系番号3', () => {
    it('広島の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([26641, -169844], 3, 'Tokyo'), [132.45414935762741, 34.471656871627964])
    })
  })

  describe('系番号4', () => {
    it('高知の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([2423, 62448], 4, 'Tokyo'), [133.52348055629835 ,33.56649433464864])
    })
  })

  describe('系番号5', () => {
    it('兵庫の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([38853, -125162], 5, 'Tokyo'), [134.75559715532708, 34.87412308207928])
    })
  })

  describe('系番号6', () => {
    it('兵庫の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-21305, -108735], 6, 'Tokyo'), [135.7636477655977, 35.02274981438785])
    })
  })

  describe('系番号7', () => {
    it('石川の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-26420, 86576], 7, 'Tokyo'), [136.86761099662178, 36.7830316455248])
    })
  })

  describe('系番号8', () => {
    it('長野の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-47397, 26960], 8, 'Tokyo'), [137.9694923108446, 36.24498327952171])
    })
  })

  describe('系番号9', () => {
    it('東京の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-12424, -35192], 9, 'Tokyo'), [139.69282912008214, 35.685922560425546])
    })
  })

  describe('系番号10', () => {
    it('宮城の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([3371, -192731], 10, 'Tokyo'), [140.86841865414655, 38.26657501195387])
    })
  })

  describe('系番号11', () => {
    it('北海道[函館付近]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([41500, -237180], 11, 'Tokyo'), [140.74632683645237, 41.86601333746568])
    })
  })

  describe('系番号12', () => {
    it('北海道[札幌付近]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-72749, -104136], 12, 'Tokyo'), [141.3530308331775, 43.061448145693205])
    })
  })

  describe('系番号13', () => {
    it('北海道[根室付近]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([108838, -73510], 13, 'Tokyo'), [145.58812452252081, 43.332898547545724])
    })
  })

  describe('系番号14', () => {
    it('東京[硫黄島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-69921, -135426], 14, 'Tokyo'), [141.30547041022507, 24.780067731279935])
    })
  })

  describe('系番号15', () => {
    it('沖縄[那覇]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([18939, 22555], 15, 'Tokyo'), [127.68759181114677, 26.207529113223135])
    })
  })

  describe('系番号16', () => {
    it('沖縄[石垣島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([19383, -179230], 16, 'Tokyo'), [124.189485430729, 24.385776468238305])
    })
  })

  describe('系番号17', () => {
    it('沖縄[南大東村]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([24764, -17253], 17, 'Tokyo'), [131.24483834747278, 25.84814428799997])
    })
  })

  describe('系番号18', () => {
    it('東京[沖ノ鳥島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([7703, 46796], 18, 'Tokyo'), [136.07129632476932, 20.4274808340046])
    })
  })

  describe('系番号19', () => {
    it('沖縄[南鳥島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-1479, -190269], 19, 'Tokyo'), [153.9815711187467, 24.286772196681824])
    })
  })
})


describe('[JGD2000] 測地系について', () => {
  describe('系番号1', () => {
    it('長崎の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-2862, 29086], 1, 'JGD2000'), [129.4692807765706 ,33.262278685768706])
    })
  })

  describe('系番号2', () => {
    it('福岡の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-19435, 61387], 2, 'JGD2000'), [130.7906980530276 ,33.55336626420523])
    })
  })

  describe('系番号3', () => {
    it('広島の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([26641, -169844], 3, 'JGD2000'), [132.4566672321507 ,34.46861679557172])
    })
  })

  describe('系番号4', () => {
    it('高知の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([2423, 62448], 4, 'JGD2000'), [133.52609704059887 ,33.563107316652])
    })
  })

  describe('系番号5', () => {
    it('兵庫の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([38853, -125162], 5, 'JGD2000'), [134.7583171027694, 34.87103642777899])
    })
  })

  describe('系番号6', () => {
    it('兵庫の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-21305, -108735], 6, 'JGD2000'), [135.7665392536752, 35.01964096165357])
    })
  })

  describe('系番号7', () => {
    it('石川の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-26420, 86576], 7, 'JGD2000'), [136.87067327842215, 36.77991094656675])
    })
  })

  describe('系番号8', () => {
    it('長野の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-47397, 26960], 8, 'JGD2000'), [137.9726577091534, 36.241829761863606])
    })
  })

  describe('系番号9', () => {
    it('東京の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-12424, -35192], 9, 'JGD2000'), [139.69607346275978, 35.68271944989707])
    })
  })

  describe('系番号10', () => {
    it('宮城の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([3371, -192731], 10, 'JGD2000'), [140.87185545442213, 38.2637865300668])
    })
  })

  describe('系番号11', () => {
    it('北海道[函館付近]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([41500, -237180], 11, 'JGD2000'), [140.74988469899284, 41.86370043062487])
    })
  })

  describe('系番号12', () => {
    it('北海道[札幌付近]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-72749, -104136], 12, 'JGD2000'), [141.35687909844907, 43.059129515832964])
    })
  })

  describe('系番号13', () => {
    it('北海道[根室付近]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([108838, -73510], 13, 'JGD2000'), [145.59210514237438, 43.330437276704444])
    })
  })

  describe('系番号14', () => {
    it('東京[硫黄島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-69921, -135426], 14, 'JGD2000'), [141.30856179055652, 24.775790423500535])
    })
  })

  describe('系番号15', () => {
    it('沖縄[那覇]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([18939, 22555], 15, 'JGD2000'), [127.68951370614744, 26.203479687936063])
    })
  })

  describe('系番号16', () => {
    it('沖縄[石垣島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([19383, -179230], 16, 'JGD2000'), [124.19107971951725, 24.381764836595853])
    })
  })

  describe('系番号17', () => {
    it('沖縄[南大東村]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([24764, -17253], 17, 'JGD2000'), [131.247047804247, 25.844042780266797])
    })
  })

  describe('系番号18', () => {
    it('東京[沖ノ鳥島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([7703, 46796], 18, 'JGD2000'), [136.07381570806194, 20.422728220527116])
    })
  })

  describe('系番号19', () => {
    it('沖縄[南鳥島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-1479, -190269], 19, 'JGD2000'), [153.98543122687832, 24.28221143341296])
    })
  })
})

describe('[JGD2011] 測地系について', () => {
  describe('系番号1', () => {
    it('長崎の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-2862, 29086], 1, 'JGD2011'), [129.4692807765706 ,33.262278685768706])
    })
  })

  describe('系番号2', () => {
    it('福岡の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-19435, 61387], 2, 'JGD2011'), [130.7906980530276 ,33.55336626420523])
    })
  })

  describe('系番号3', () => {
    it('広島の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([26641, -169844], 3, 'JGD2011'), [132.4566672321507 ,34.46861679557172])
    })
  })

  describe('系番号4', () => {
    it('高知の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([2423, 62448], 4, 'JGD2011'), [133.52609704059887 ,33.563107316652])
    })
  })

  describe('系番号5', () => {
    it('兵庫の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([38853, -125162], 5, 'JGD2011'), [134.7583171027694, 34.87103642777899])
    })
  })

  describe('系番号6', () => {
    it('兵庫の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-21305, -108735], 6, 'JGD2011'), [135.7665392536752, 35.01964096165357])
    })
  })

  describe('系番号7', () => {
    it('石川の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-26420, 86576], 7, 'JGD2011'), [136.87067327842215, 36.77991094656675])
    })
  })

  describe('系番号8', () => {
    it('長野の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-47397, 26960], 8, 'JGD2011'), [137.9726577091534, 36.241829761863606])
    })
  })

  describe('系番号9', () => {
    it('東京の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-12424, -35192], 9, 'JGD2011'), [139.69607346275978, 35.68271944989707])
    })
  })

  describe('系番号10', () => {
    it('宮城の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([3371, -192731], 10, 'JGD2011'), [140.87185545442213, 38.2637865300668])
    })
  })

  describe('系番号11', () => {
    it('北海道[函館付近]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([41500, -237180], 11, 'JGD2011'), [140.74988469899284, 41.86370043062487])
    })
  })

  describe('系番号12', () => {
    it('北海道[札幌付近]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-72749, -104136], 12, 'JGD2011'), [141.35687909844907, 43.059129515832964])
    })
  })

  describe('系番号13', () => {
    it('北海道[根室付近]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([108838, -73510], 13, 'JGD2011'), [145.59210514237438, 43.330437276704444])
    })
  })

  describe('系番号14', () => {
    it('東京[硫黄島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-69921, -135426], 14, 'JGD2011'), [141.30856179055652, 24.775790423500535])
    })
  })

  describe('系番号15', () => {
    it('沖縄[那覇]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([18939, 22555], 15, 'JGD2011'), [127.68951370614744, 26.203479687936063])
    })
  })

  describe('系番号16', () => {
    it('沖縄[石垣島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([19383, -179230], 16, 'JGD2011'), [124.19107971951725, 24.381764836595853])
    })
  })

  describe('系番号17', () => {
    it('沖縄[南大東村]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([24764, -17253], 17, 'JGD2011'), [131.247047804247, 25.844042780266797])
    })
  })

  describe('系番号18', () => {
    it('東京[沖ノ鳥島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([7703, 46796], 18, 'JGD2011'), [136.07381570806194, 20.422728220527116])
    })
  })

  describe('系番号19', () => {
    it('沖縄[南鳥島]の平面直角座標を正しく緯度経度に変換できること', () => {
      assert.deepEqual(target.toWGS84LngLat([-1479, -190269], 19, 'JGD2011'), [153.98543122687832, 24.28221143341296])
    })
  })
})
